app/controllers/potholes_controller.rb

  def index
    @potholes = Pothole.all
---
SELECT "potholes".* FROM "potholes"

  def create
    @pothole = Pothole.new(pothole_params)

    respond_to do |format|
      if @pothole.save
---
INSERT INTO "potholes" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sat, 23 Nov 2013 02:47:47 UTC +00:00], ["updated_at", Sat, 23 Nov 2013 02:47:47 UTC +00:00]]

  def destroy
    @pothole.destroy
---
DELETE FROM "potholes" WHERE "potholes"."id" = ?  [["id", 1]]

    def set_pothole
      @pothole = Pothole.find(params[:id])
---
SELECT "potholes".* FROM "potholes" WHERE "potholes"."id" = ? LIMIT 1  [["id", "1"]]